In [3]:
#Work as SQL
import pandas as pd
import sqlite3

In [7]:
#read the CSV
df = pd.read_csv('./data/casoscovid19.csv')
#connect to a database
conn = sqlite3.connect("casoscovid19.db") #if the db does not exist, this creates a Any_Database_Name.db file in the current directory
#store your table in the database:
df.to_sql('test_0', conn)

ValueError: Table 'test_0' already exists.

In [50]:
#read a SQL Query out of your database and into a pandas dataframe
sql_string = 'SELECT * FROM test_0'
sql_string = 'SELECT COUNT(*) FROM test_0 WHERE clasificacion LIKE "%Caso confirmado%";'
gg = pd.read_sql(sql_string, conn)
gg

   COUNT(*)
0    208031

In [37]:
#read a SQL Query out of your database and into a pandas dataframe
sql_string = 'SELECT * FROM test_0 LIMIT 5;'
gg = pd.read_sql(sql_string, conn)
gg

,index,id_evento_caso,sexo,edad,edad_años_meses,residencia_pais_nombre,residencia_provincia_nombre,residencia_departamento_nombre,carga_provincia_nombre,fecha_inicio_sintomas,...,fecha_fallecimiento,asistencia_respiratoria_mecanica,carga_provincia_id,origen_financiamiento,clasificacion,clasificacion_resumen,residencia_provincia_id,fecha_diagnostico,residencia_departamento_id,ultima_actualizacion
0,0,1000000,M,53.0,Años,Argentina,CABA,SIN ESPECIFICAR,Buenos Aires,None,...,None,NO,6.0,Privado,Caso Descartado,Descartado,2.0,2020-06-09,0.0,2020-08-05
1,1,1000002,M,21.0,Años,Argentina,Buenos Aires,La Matanza,Buenos Aires,None,...,None,NO,6.0,Público,Caso Descartado,Descartado,6.0,2020-06-01,427.0,2020-08-05
2,2,1000003,F,40.0,Años,Argentina,Córdoba,Capital,Córdoba,2020-05-24,...,None,NO,14.0,Privado,Caso Descartado,Descartado,14.0,2020-06-01,14.0,2020-08-05
3,3,1000005,F,58.0,Años,Argentina,Mendoza,Las Heras,Mendoza,None,...,None,NO,50.0,Público,Caso Descartado,Descartado,50.0,2020-06-01,49.0,2020-08-05
4,4,1000006,M,28.0,Años,Argentina,Buenos Aires,Malvinas Argentinas,Buenos Aires,2020-05-30,...,None,NO,6.0,Público,Caso sospechoso - Con muestra sin resultado,Sospechoso,6.0,None,515.0,2020-08-05

In [ ]:
ultima_actualizacion

In [54]:
sql_string = 'SELECT DISTINCT residencia_departamento_nombre FROM test_0 WHERE residencia_provincia_nombre="Buenos Aires";'
gg = pd.read_sql(sql_string, conn)
gg

    residencia_departamento_nombre
0                       La Matanza
1              Malvinas Argentinas
2               Esteban Echeverría
3                            Tigre
4                  Tres de Febrero
..                             ...
131                       Tapalqué
132                     Pellegrini
133                  General Guido
134                       Tordillo
135                        Capital

[136 rows x 1 columns]

In [51]:
sql_string = 'SELECT DISTINCT residencia_departamento_nombre FROM test_0 WHERE residencia_provincia_nombre="Buenos Aires";'
sql_string = 'select residencia_departamento_nombre, count(*) from test_0 WHERE residencia_provincia_nombre="Buenos Aires" group by residencia_departamento_nombre;'
gg = pd.read_sql(sql_string, conn)
gg

    residencia_departamento_nombre  count(*)
0                       25 de Mayo       166
1                       9 de Julio       233
2                    Adolfo Alsina        30
3           Adolfo Gonzales Chaves        32
4                          Alberti       134
..                             ...       ...
131                Tres de Febrero     12561
132                  Vicente López      7125
133                   Villa Gesell       115
134                      Villarino        94
135                         Zárate      1995

[136 rows x 2 columns]

In [53]:
sql_string = 'SELECT DISTINCT residencia_departamento_nombre FROM test_0 WHERE residencia_provincia_nombre="Buenos Aires";'
gg = pd.read_sql(sql_string, conn)
gg

    residencia_departamento_nombre
0                       La Matanza
1              Malvinas Argentinas
2               Esteban Echeverría
3                            Tigre
4                  Tres de Febrero
..                             ...
131                       Tapalqué
132                     Pellegrini
133                  General Guido
134                       Tordillo
135                        Capital

[136 rows x 1 columns]

In [46]:
sql_string = 'select residencia_departamento_nombre, count(*) from test_0 WHERE carga_provincia_nombre="Buenos Aires"  and clasificacion LIKE "%Caso confirmado%" group by residencia_departamento_nombre;'

sql_string = 'SELECT residencia_departamento_nombre, count(*) FROM test_0 WHERE (residencia_provincia_nombre="Buenos Aires"  AND clasificacion LIKE "%Caso confirmado%") group by residencia_departamento_nombre;'
gg = pd.read_sql(sql_string, conn)
gg

    residencia_departamento_nombre  count(*)
0                       25 de Mayo        34
1                       9 de Julio        18
2                    Adolfo Alsina         2
3           Adolfo Gonzales Chaves         1
4                          Alberti        12
..                             ...       ...
125                Tres de Febrero      4812
126                  Vicente López      2222
127                   Villa Gesell         8
128                      Villarino        11
129                         Zárate       442

[130 rows x 2 columns]

In [48]:
sql_string = 'SELECT residencia_departamento_nombre, count(*) FROM test_0 WHERE (residencia_provincia_nombre="Buenos Aires"  AND clasificacion_resumen="Confirmado") group by residencia_departamento_nombre;'
gg = pd.read_sql(sql_string, conn)
gg

    residencia_departamento_nombre  count(*)
0                       25 de Mayo        34
1                       9 de Julio        18
2                    Adolfo Alsina         2
3           Adolfo Gonzales Chaves         1
4                          Alberti        12
..                             ...       ...
125                Tres de Febrero      4812
126                  Vicente López      2222
127                   Villa Gesell         8
128                      Villarino        11
129                         Zárate       442

[130 rows x 2 columns]

In [44]:
sql_string = 'SELECT residencia_provincia_nombre, count(*) FROM test_0 WHERE (clasificacion_resumen="Confirmado") group by residencia_provincia_nombre;'
#sql_string = 'SELECT carga_provincia_nombre, count(*) FROM test_0 WHERE (clasificacion_resumen="Confirmado") group by carga_provincia_nombre;'
gg = pd.read_sql(sql_string, conn)
gg

   residencia_provincia_nombre  count(*)
0                 Buenos Aires    128433
1                         CABA     58205
2                    Catamarca        60
3                        Chaco      3381
4                       Chubut       295
5                   Corrientes       157
6                      Córdoba      2733
7                   Entre Ríos       935
8                      Formosa        71
9                        Jujuy      2881
10                    La Pampa       165
11                    La Rioja       400
12                     Mendoza      1655
13                    Misiones        48
14                     Neuquén      1298
15                   Río Negro      2311
16             SIN ESPECIFICAR      1249
17                       Salta       361
18                    San Juan        21
19                    San Luis        33
20                  Santa Cruz       613
21                    Santa Fe      1616
22         Santiago del Estero        62
23            Tierra del Fuego       733
24                     Tucumán       315

In [49]:
sql_string = 'SELECT count(*) FROM test_0 WHERE (clasificacion_resumen="Confirmado");'
gg = pd.read_sql(sql_string, conn)
gg

   count(*)
0    208031